<template>
  <v-container>
    <h1>家庭天地</h1>
    <v-row>
      <p style="padding:50px">
        也許我生在一個很正常的家庭，有一個爸爸、一個媽媽、爺爺奶奶外公外婆也都還健在，但不一樣的是，我有一群個性鮮明的家人，總會擦出很多莫名的故事，生在這家中，無一天沒樂趣呀！
      </p>
    </v-row>
    <hr>
    <h1 id="Hito" style="padding-top:30px">沂佐篇</h1>
    <v-row>
      
      <p style="padding-left:50px"><br>在家中，大家都有好笑呆萌的一面，每個人都有各自有趣的故事，居然作者是我，那便從我的故事開始說起吧！<br>我小時候的故事有很多，一是因為自己本來就好笑而且邏輯很清楚，二是我媽真的很特別。</p>
    </v-row>

    <v-row class="text-center">

      <v-col 
        cols="3" 
        v-for="(hito,i) in Hito"
        :key="i">
        <v-dialog width="50%">
          <template v-slot:activator="{on,attrs}">
            <v-card 
              hover="true"
              v-bind="attrs"
              v-on="on"
            >
              <v-card-title>{{hito.title}}</v-card-title>
            </v-card>
          </template>
          <v-card>
            <v-card-title><b>{{hito.title}}</b></v-card-title>
            <v-card-text style="color:midnightblue">{{hito.text}}</v-card-text>
          </v-card>
        </v-dialog>
      </v-col>
      
    </v-row>


  </v-container>
</template>

<script>
  export default {
    name: 'myFamily',
    data: () => ({
      return:{
        dialog:false,
      },

      Hito: [
        {
          title:"廚房內的媽媽不是我媽",
          text:"小學以前，我媽媽從來不做菜，自從來到教會，小組的姊妹和我媽說，一週至少要有一餐做飯給家人吃，回到家，媽媽便買了菜，準備做一桌豐盛的料理給我和爸爸。對於活了七年從來沒看過媽媽下廚的我，這新奇的畫面吸引了我，看著菜刀一次次的落在砧板，聽著油嗶嗶啵啵的跳躍聲，聞著一陣陣撲鼻的香味，我好奇的問媽媽：「媽媽，你這個炒菜是有技巧的還是隨便亂炒的？」媽媽聽了有點生氣，但又不經意笑了出來：「炒菜是要把上方沒有碰到鍋底的菜也能熱到，所以炒是讓上下的菜能對調。」「為什麼你會知道這種事情啊？」對於我的質問，媽媽有點哭笑不得：「我不是不會做菜，只是我不喜歡做而已。」「喔，沒想到媽媽會的東西還包括煮菜啊！」我猜媽媽那時真的很想打我吧。",
        },
        {
          title:'營養午餐難吃嗎?',
          text:'基於媽媽不太會做菜的緣故，許多小孩的夢魘——營養午餐，在我看來便是美食數道，好吃的不得了。常常會有這樣的對話，「今天的營養午餐好難吃喔，那些便當公司的人到底怎麼做的啊？」「會嗎？我覺得滿好吃的啊！」「不能拿你作為判斷食物的標準啦！」「是嗎？明明就很好吃啊。」我便滿臉疑惑的轉身繼續吃我的便當。',
        },
        {
          title:'眼睛都會瞎掉!!',
          text:'我們家崇尚電動，我媽非常的支持小孩玩電動，這點可能也是從外公傳承下來的，他們認為電動能夠提升解決問題的能力，她自己也非常喜歡玩。有次有媽媽的朋友來我們玩，媽媽像平常一樣跟我一起玩著電動，只不過把螢幕用投影機投射出來，讓大家都有參與感。時間一點一點的過去，大人們喝著酒還很開心的在聊天，此時的我已經十分疲憊了，自己默默的進了房間，但他們真的太吵了，而且我也想一起玩遊戲，便拖著身體走出去大喊：「再玩你們眼睛都會瞎掉！」所有人都愣了一下，也包含我自己，我又緩緩的再次走入房間，媽媽笑了出來，並幫我圓了場：「沂佐說他要睡覺了，叫我們小聲一點啦。」',
        },
        {
          title:'是誰的溜滑梯?',
          text:'我兩歲時，表弟剛出生，連坐都還不會，我跟著媽媽回到外婆家，正玩著大人們買給表弟的溜滑梯。外婆看到我，便說：「那個是洋洋（表弟的小名）的，你怎麼自己就玩起來了呢？」我坐在溜滑梯上看著外婆「這是你們買給洋洋的對不對？」「呃......對啊。」「所以是我們家裡的溜滑梯對不對？」「對啊。」「那洋洋現在會玩嗎？」「不會。」「那這個家能玩溜滑梯的是不是只有我一個。」「這......對。」「那我應該可以玩吧？」「可以......」外婆語音未落，我便從上面滑了下來，外婆說不過我，默默離開跑去罵媽媽「你怎麼把小孩教成這樣？」媽媽滿臉困惑，不知道發生了什麼事。',
        },
        {
          title:'獨立的原因',
          text:'小時候還發生很多的事情，為了在我們家求生存，我自己要做的事我現在聽起來都覺得神奇，比如說兩歲就必須自己泡奶來喝，媽媽只負責洗奶瓶；只會爬的時候，就是我自己拿著尿布提醒媽媽要幫我換。因為我媽的隨性，我好像從小就挺獨立的，也不知道是好事或壞事。',
        },
      ],
    }),
  }
</script>